'use strict';

/**
 * @ngdoc overview
 * @name exampleApp
 * @description
 * # exampleApp
 *
 * Main module of the application.
 */
angular.module('exampleApp',['ngminieditor'])
    .controller('demoCtr',['$scope',function($scope){
        $scope.minieditors=[
            {
                'type':0,
                'editcontents':[
                    {'type':'image','src':'http://img02.taobaocdn.com/imgextra/i2/258789035/TB2hIkTbpXXXXctXXXXXXXXXXXX_!!258789035.jpg_290x10000.jpg'},
                    {'type':'text',
                        'value':
                            '促销活动：凡是在本店新买家享有特殊优惠<br>纯天然黄山贡菊<br>黄山贡菊具有清肝明目、驱邪降火、清凉解表的功效。菊花茶对口干、火旺、目涩有作用，热饮后，全身发汗感到轻松，是医治感冒的良药，也是老少皆宜的保健饮料。<br>“黄山贡菊”具有疏风散热、养肝明目、清凉解毒之功能，可治伤风感冒、疔疮肿毒、血压偏高及动脉硬化等症。用它调配其它药物可以制成桑菊感冒片等成药和菊花晶等饮料。可以泡茶、泡酒，常饮可清净五脏，排毒健身，有排毒美容之功效。饮用过的菊花晒干后还可充作枕芯，使人清凉降火，明目醒脑。<br>菊花性味微寒，不可用量过大，脾胃虚'
                    },
                    {'type':'shortDesc',
                        'value':
                            '促销活动：凡是在本店新买家享有特殊优惠<br>纯天然黄山贡菊<br>黄山贡菊具有清肝明目、驱邪降火、清凉解表的功效。菊花茶对口干、火旺、目涩有作用，热饮后，全身发汗感到轻松，是医治感冒的良药，也是老少皆宜的保健饮料。<br>“黄山贡菊”具有疏风散热、养肝明目、清凉解毒之功能，可治伤风感冒、疔疮肿毒、血压偏高及动脉硬化等症。用它调配其它药物可以制成桑菊感冒片等成药和菊花晶等饮料。可以泡茶、泡酒，常饮可清净五脏，排毒健身，有排毒美容之功效。饮用过的菊花晒干后还可充作枕芯，使人清凉降火，明目醒脑。<br>菊花性味微寒，不可用量过大，脾胃虚'
                    }
                ]},
            {
                'type':1,
                'editcontents':[
                    {'type':'image','src':'http://img02.taobaocdn.com/imgextra/i2/258789035/TB2hIkTbpXXXXctXXXXXXXXXXXX_!!258789035.jpg_290x10000.jpg'},
                    {'type':'text',
                        'value':
                            '促销活动：凡是在本店新买家享有特殊优惠<br>纯天然黄山贡菊<br>黄山贡菊具有清肝明目、驱邪降火、清凉解表的功效。菊花茶对口干、火旺、目涩有作用，热饮后，全身发汗感到轻松，是医治感冒的良药，也是老少皆宜的保健饮料。<br>“黄山贡菊”具有疏风散热、养肝明目、清凉解毒之功能，可治伤风感冒、疔疮肿毒、血压偏高及动脉硬化等症。用它调配其它药物可以制成桑菊感冒片等成药和菊花晶等饮料。可以泡茶、泡酒，常饮可清净五脏，排毒健身，有排毒美容之功效。饮用过的菊花晒干后还可充作枕芯，使人清凉降火，明目醒脑。<br>菊花性味微寒，不可用量过大，脾胃虚'
                    },
                    {'type':'shortDesc',
                        'value':
                            '促销活动：凡是在本店新买家享有特殊优惠<br>纯天然黄山贡菊<br>黄山贡菊具有清肝明目、驱邪降火、清凉解表的功效。菊花茶对口干、火旺、目涩有作用，热饮后，全身发汗感到轻松，是医治感冒的良药，也是老少皆宜的保健饮料。<br>“黄山贡菊”具有疏风散热、养肝明目、清凉解毒之功能，可治伤风感冒、疔疮肿毒、血压偏高及动脉硬化等症。用它调配其它药物可以制成桑菊感冒片等成药和菊花晶等饮料。可以泡茶、泡酒，常饮可清净五脏，排毒健身，有排毒美容之功效。饮用过的菊花晒干后还可充作枕芯，使人清凉降火，明目醒脑。<br>菊花性味微寒，不可用量过大，脾胃虚'
                    }
                ]

            },
            {
                'type':2,
                'editcontents':[
                    {'type':'image','src':'http://img02.taobaocdn.com/imgextra/i2/258789035/TB2hIkTbpXXXXctXXXXXXXXXXXX_!!258789035.jpg_290x10000.jpg'},
                    {'type':'text',
                        'value':
                            '促销活动：凡是在本店新买家享有特殊优惠<br>纯天然黄山贡菊<br>黄山贡菊具有清肝明目、驱邪降火、清凉解表的功效。菊花茶对口干、火旺、目涩有作用，热饮后，全身发汗感到轻松，是医治感冒的良药，也是老少皆宜的保健饮料。<br>“黄山贡菊”具有疏风散热、养肝明目、清凉解毒之功能，可治伤风感冒、疔疮肿毒、血压偏高及动脉硬化等症。用它调配其它药物可以制成桑菊感冒片等成药和菊花晶等饮料。可以泡茶、泡酒，常饮可清净五脏，排毒健身，有排毒美容之功效。饮用过的菊花晒干后还可充作枕芯，使人清凉降火，明目醒脑。<br>菊花性味微寒，不可用量过大，脾胃虚'
                    },
                    {'type':'shortDesc',
                        'value':
                            '促销活动：凡是在本店新买家享有特殊优惠<br>纯天然黄山贡菊<br>黄山贡菊具有清肝明目、驱邪降火、清凉解表的功效。菊花茶对口干、火旺、目涩有作用，热饮后，全身发汗感到轻松，是医治感冒的良药，也是老少皆宜的保健饮料。<br>“黄山贡菊”具有疏风散热、养肝明目、清凉解毒之功能，可治伤风感冒、疔疮肿毒、血压偏高及动脉硬化等症。用它调配其它药物可以制成桑菊感冒片等成药和菊花晶等饮料。可以泡茶、泡酒，常饮可清净五脏，排毒健身，有排毒美容之功效。饮用过的菊花晒干后还可充作枕芯，使人清凉降火，明目醒脑。<br>菊花性味微寒，不可用量过大，脾胃虚'
                    }
                ]
            }
        ]
    }])
